test/request-response-samples/DefaultNamespace__no_xmlns_prefix_used_for_default_namespace/request.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Header/><soap:Body>
<ns1:Request xmlns:ns1="http://www.example.com/v1"/>
</soap:Body></soap:Envelope>